# AlignmentId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabel..::..AlignmentId Property
AlignmentStationLabel Class See Also
---
The ElementId of the Alignment on which the SpotDimension is placed.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public ElementId AlignmentId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AlignmentId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ AlignmentId {
	ElementId^ get ();
}
```

# See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace